{
  "items": [
    {
      "title": "I downloaded a learning object on Windows and I can't open it.",
      "copy": "<p>This issue is typically related to the <a href='https://docs.microsoft.com/en-us/windows/desktop/fileio/naming-a-file' target='_blank'>Windows operating system's max path length of 260 characters</a> when downloading deeply nested learning objects or learning objects with long folder/filenames, their destination may make their path (C:\\folder1\\folder2...) more than 260 characters.</p><p>To fix this issue, try moving the learning object to a directory before unzipping it. If that doesn't work, you can use a third-party application like 7-zip to unzip the object with varied success; the individual files will still need to be moved to a higher directory before opening.</p>"
    },
    {
      "title": "I downloaded a learning object and it doesn't appear to have all of it's files.",
      "copy": "<p>There are several possible reasons for this. Firstly, in an effort to keep download times manageable, CLARK doesn't include files over 100 megabytes in the download package. Instead, links to those files are provided in the learning object's README pdf. It is our intention to provide reviewers and users attempting to quickly inspect a learning object's materials with the ability to do so in an efficient manner while still making the full couse materials available</p><p>In addition to this, files labeled as solution files (the name of the file includes the string 'solution' at the end) are not returned by the CLARK system in an effort to prevent students from obtaining the answers to quizes, assignments, and exams. Please contact the author directly to obtain the solution files.</p>"
    },
    {
      "title": "I submitted my learning object to a collection but I can't find it by browsing.",
      "copy": "<p>Learning objects created in CLARK undergo an extensive review process by the owners of each collection before they are publicly accessible. In this way CLARK will maintain a well-currated library of learning objects.</p>"
    }
  ]
}